Tekla Open API Reference for Tekla Structures 2025
Circle Constructor
Overload List
Name | Description
Circle(ViewBase, Point, Double)
 Creates a new circle instance with a center point and a radius using standard attributes.
Circle(ViewBase, Point, Double, Circle.CircleAttributes)
 Creates a new circle instance with a center point and a radius using the given attributes.
Top
See Also
Reference
Circle Class
Tekla.Structures.Drawing Namespace